# 100 pandas puzzles

Here are 100* short puzzles for testing your knowledge of [pandas'](http://pandas.pydata.org/) power.

Since pandas is a large library with many different specialist features and functions, these excercises focus mainly on the fundamentals of manipulating data (indexing, grouping, aggregating, cleaning), making use of the core DataFrame and Series objects. 

Many of the excerises here are stright-forward in that the solutions require no more than a few lines of code (in pandas or NumPy... don't go using pure Python!). Choosing the right methods and following best practices is the underlying goal.

The exercises are loosely divided in sections. Each section has a difficulty rating; these ratings are subjective, of course, but should be a seen as a rough guide as to how inventive the required solution is.

If you are looking for some other resources with pandas, the official documentation  is very extensive. In particular, some good places get a broader overview of pandas are...

- [10 minutes to pandas](http://pandas.pydata.org/pandas-docs/stable/10min.html)
- [pandas basics](http://pandas.pydata.org/pandas-docs/stable/basics.html)
- [tutorials](http://pandas.pydata.org/pandas-docs/stable/tutorials.html)
- [cookbook and idioms](http://pandas.pydata.org/pandas-docs/stable/cookbook.html#cookbook)

Enjoy the puzzles!

## Importing pandas

### Getting started and checking your pandas setup

Difficulty: *easy* 

**1.** Import pandas under the name `pd`.

In [1]:
import pandas as pd
import numpy as np

**2.** Print the version of pandas that has been imported.

In [2]:
pd.__version__

'1.1.5'

**3.** Print out all the version information of the libraries that are required by the pandas library.

In [3]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : b5958ee1999e9aead1938c0bba2b674378807b3d
python           : 3.8.5.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.19041
machine          : AMD64
processor        : Intel64 Family 6 Model 158 Stepping 9, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : English_United Kingdom.1252

pandas           : 1.1.5
numpy            : 1.19.3
pytz             : 2020.4
dateutil         : 2.8.1
pip              : 20.2.4
setuptools       : 50.3.1.post20201107
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : None
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : 2.11.2
IPython          : 7.19.0
pandas_datareader: None
bs4              : None
bottleneck       : None
fsspec           : None
fastparquet      : None
gcsfs            : None
matplotlib       : 3.3.3
numexpr          : None
odfpy            : None
openpyxl         : None
pandas_gbq       : None
pyarrow          : None
pytables         : None
pyxlsb           : None
s3fs             : None
scipy            : 1.5.4
sqlalchemy       : None
tables           : None
tabulate         : None
xarray           : None
xlrd             : 1.2.0
xlwt             : None
numba            : None

## DataFrame basics

### A few of the fundamental routines for selecting, sorting, adding and aggregating data in DataFrames

Difficulty: *easy*

Note: remember to import numpy using:
```python
import numpy as np
```

Consider the following Python dictionary `data` and Python list `labels`:

``` python
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
```
(This is just some meaningless data I made up with the theme of animals and trips to a vet.)

**4.** Create a DataFrame `df` from this dictionary `data` which has the index `labels`.

In [4]:
import numpy as np

In [5]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [6]:
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

**5.** Display a summary of the basic information about this DataFrame and its data.

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

**6.** Return the first 3 rows of the DataFrame `df`.

In [8]:
df[:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

**7.** Select just the 'animal' and 'age' columns from the DataFrame `df`.

In [9]:
df_animal_age = df[['animal', 'age']]
df_animal_age

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

**8.** Select the data in rows `[3, 4, 8]` *and* in columns `['animal', 'age']`.

In [10]:
df_animal_age.iloc[[3,4,8]]  ##  df[['animal', 'age']].iloc[[3,4,8]]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

**9.** Select only the rows where the number of visits is greater than 3.

In [11]:
df[df['visits'] > 2]

  animal  age  visits priority
b    cat  3.0       3      yes
d    dog  NaN       3      yes
f    cat  2.0       3       no

**10.** Select the rows where the age is missing, i.e. is `NaN`.

In [12]:
df[df['age'].isna()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

**11.** Select the rows where the animal is a cat *and* the age is less than 3.

In [13]:
df[(df['animal'] == 'cat') & (df['age'] < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

**12.** Select the rows the age is between 2 and 4 (inclusive).

In [14]:
df[(df['age'] > 2) & (df['age'] < 4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
j    dog  3.0       1       no

**13.** Change the age in row 'f' to 1.5.

In [15]:
df['age'].loc['f'] = 1.5
df['age'].loc['f']

1.5

**14.** Calculate the sum of all visits (the total number of visits).

In [16]:
df['visits'].sum()

19

**15.** Calculate the mean age for each different animal in `df`.

In [17]:
df.groupby('animal')['age'].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

In [18]:
df.groupby('animal').mean()['age']

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

**16.** Append a new row 'k' to `df` with your choice of values for each column. Then delete that row to return the original DataFrame.

In [20]:
#k = pd.DataFrame({'animal': 'cow', 'visits': 6, 'age': 3, 'priority': 'no'})

df.append({'animal': 'cow', 'visits': 6, 'age': 3, 'priority': 'no'}, ignore_index=True)

   animal  age  visits priority
0     cat  2.5       1      yes
1     cat  3.0       3      yes
2   snake  0.5       2       no
3     dog  NaN       3      yes
4     dog  5.0       2       no
5     cat  1.5       3       no
6   snake  4.5       1       no
7     cat  NaN       1      yes
8     dog  7.0       2       no
9     dog  3.0       1       no
10    cow  3.0       6       no

**17.** Count the number of each type of animal in `df`.

In [21]:
df['animal'].value_counts()

cat      4
dog      4
snake    2
Name: animal, dtype: int64

**18.** Sort `df` first by the values in the 'age' in *decending* order, then by the value in the 'visit' column in *ascending* order.

In [22]:
df.sort_values(['age', 'visits'], ascending=[False, True])

#df.sort_values(by=['2'], ascending=False)

  animal  age  visits priority
i    dog  7.0       2       no
e    dog  5.0       2       no
g  snake  4.5       1       no
j    dog  3.0       1       no
b    cat  3.0       3      yes
a    cat  2.5       1      yes
f    cat  1.5       3       no
c  snake  0.5       2       no
h    cat  NaN       1      yes
d    dog  NaN       3      yes

**19.** The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be `True` and 'no' should be `False`.

In [23]:
df['priority'].replace(['yes', 'no'], [True, False])

a     True
b     True
c    False
d     True
e    False
f    False
g    False
h     True
i    False
j    False
Name: priority, dtype: bool

**20.** In the 'animal' column, change the 'snake' entries to 'python'.

In [24]:
df['animal'][df['animal'] == 'snake'] = 'python'
df

   animal  age  visits priority
a     cat  2.5       1      yes
b     cat  3.0       3      yes
c  python  0.5       2       no
d     dog  NaN       3      yes
e     dog  5.0       2       no
f     cat  1.5       3       no
g  python  4.5       1       no
h     cat  NaN       1      yes
i     dog  7.0       2       no
j     dog  3.0       1       no

**21.** For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (hint: use a pivot table).

In [25]:

pd.pivot_table(df, values='age', index='animal', columns='visits', aggfunc='mean')

#pd.pivot(df, index='animal',columns='visits',values='age')

visits    1    2     3
animal
cat     2.5  NaN  2.25
dog     3.0  6.0   NaN
python  4.5  0.5   NaN

## DataFrames: beyond the basics

### Slightly trickier: you may need to combine two or more methods to get the right answer

Difficulty: *medium*

The previous section was tour through some basic but essential DataFrame operations. Below are some ways that you might need to cut your data, but for which there is no single "out of the box" method.

**22.** You have a DataFrame `df` with a column 'A' of integers. For example:
```python
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

How do you filter out rows which contain the same integer as the row immediately above?

In [27]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})

    A
0   1
1   2
2   2
3   3
4   4
5   5
6   5
7   5
8   6
9   7
10  7

In [508]:
df[df.A == df.A.shift(periods=1)]

    A
2   2
6   5
7   5
10  7

In [512]:
for index, row in df.itertuples():
    if row == df.iloc[index-1][0]:
        print(row)

2
5
5
7

**23.** Given a DataFrame of numeric values, say
```python
df = pd.DataFrame(np.random.random(size=(5, 3))) # a 5x3 frame of float values
```

how do you subtract the row mean from each element in the row?

In [35]:
import random
random.seed = 40
df = pd.DataFrame(np.random.randint(10,size=(5, 3)), columns=['A', 'B', 'C'])
df

   A  B  C
0  9  1  5
1  2  2  5
2  1  8  3
3  7  7  6
4  3  2  1

In [191]:
df.sub(df.mean(axis=1), axis='rows').round()

     A    B    C
0  1.0 -1.0 -1.0
1  0.0  1.0 -1.0
2  2.0  0.0 -2.0
3  1.0  0.0 -1.0
4  0.0 -2.0  2.0

**24.** Suppose you have DataFrame with 10 columns of real numbers, for example:

```python
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
```
Which column of numbers has the smallest sum? (Find that column's label.)

In [43]:
df = pd.DataFrame(np.random.randint(5, size=(5, 10)), columns=list('abcdefghij'))
df

   a  b  c  d  e  f  g  h  i  j
0  2  2  4  4  2  0  3  2  0  4
1  3  3  2  1  1  3  2  0  3  1
2  0  0  0  3  4  4  2  0  1  4
3  2  2  0  0  4  1  0  0  0  0
4  1  1  0  4  3  4  1  1  2  3

In [59]:
col_idx_with_smallest_sum  = df.unstack().sum(level=0).argmin()

In [61]:
col_with_smallest_sum = df.unstack().sum(level=0).index[col_idx_with_smallest_sum]

In [63]:

print(f'Column with smallest sum is {col_with_smallest_sum}')

Column with smallest sum is h

**25.** How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)?

In [241]:
df.drop_duplicates(keep='last')

,a,b,c,d,e,f,g,h,i,j
0,0.185086,0.324050,0.021024,0.102640,0.256928,0.066909,0.668929,0.572071,0.898940,0.047467
1,0.970872,0.500834,0.850962,0.864083,0.891857,0.127321,0.514067,0.620378,0.824531,0.695750
2,0.252264,0.988399,0.131574,0.640846,0.767809,0.065567,0.644047,0.533395,0.512714,0.161959
3,0.059457,0.091582,0.775675,0.676640,0.065750,0.874468,0.204294,0.496392,0.987599,0.753883
4,0.414918,0.998623,0.986506,0.637350,0.791740,0.966638,0.315867,0.363004,0.705210,0.403472

The next three puzzles are slightly harder...

**26.** You have a DataFrame that consists of 10 columns of floating--point numbers. Suppose that exactly 5 entries in each row are NaN values. For each row of the DataFrame, find the *column* which contains the *third* NaN value.

(You should return a Series of column labels.)

In [517]:
data = {"q":[np.nan,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan],"w":[np.nan,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan],'e':[np.nan,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan],'r':[1,np.nan,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan],'t':[1,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan],'y':[np.nan,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan],'u':[1,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan],'i':[1,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan],'o':[1,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan],'p':[1,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan]}
df_nan = pd.DataFrame(data)

In [458]:
for i,d in df_nan.iterrows():
    print(d.index)

Index([0, 1, 2, '3', '4', '5'], dtype='object')
Index([0, 1, 2, '3', '4', '5'], dtype='object')
Index([0, 1, 2, '3', '4', '5'], dtype='object')
Index([0, 1, 2, '3', '4', '5'], dtype='object')
Index([0, 1, 2, '3', '4', '5'], dtype='object')

In [528]:
counter = 0
for (idx, row) in df_nan.iterrows():
    for i in range(len(row)):
        if np.isnan(row[row.index[i]]) == True:
            counter += 1
        #print(idx, i)
        if counter == 3:
            print('the nans are',idx, i)
            break
    counter = 0
#print(counter)

the nans are 0 2
the nans are 5 2
the nans are 8 2
the nans are 12 2

In [527]:
(df_nan.isnull().cumsum(axis=1)  == 3).idxmax(axis=1)##== 3).idxmax(axis=1)

0     e
1     q
2     q
3     q
4     q
5     e
6     q
7     q
8     e
9     q
10    q
11    q
12    e
dtype: object

In [529]:
data = {"q":[np.nan,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan],"w":[np.nan,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan],'e':[np.nan,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan],'r':[1,np.nan,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan],'t':[1,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan],'y':[np.nan,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan],'u':[1,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan],'i':[1,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan],'o':[1,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan],'p':[1,2,3,4,5,np.nan,6,7,np.nan,8,9,10,np.nan]}
df_26 = pd.DataFrame(data)

x = df_26.isnull().cumsum(axis=1)
x
df_26

       q     w     e     r     t     y     u     i     o     p
0    NaN   NaN   NaN   1.0   1.0   NaN   1.0   1.0   1.0   1.0
1    2.0   2.0   2.0   NaN   2.0   2.0   2.0   2.0   2.0   2.0
2    3.0   3.0   3.0   3.0   3.0   3.0   3.0   3.0   3.0   3.0
3    4.0   4.0   4.0   4.0   4.0   4.0   4.0   4.0   4.0   4.0
4    5.0   5.0   5.0   5.0   5.0   5.0   5.0   5.0   5.0   5.0
5    NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
6    6.0   6.0   6.0   6.0   6.0   6.0   6.0   6.0   6.0   6.0
7    7.0   7.0   7.0   7.0   7.0   7.0   7.0   7.0   7.0   7.0
8    NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
9    8.0   8.0   8.0   8.0   8.0   8.0   8.0   8.0   8.0   8.0
10   9.0   9.0   9.0   9.0   9.0   9.0   9.0   9.0   9.0   9.0
11  10.0  10.0  10.0  10.0  10.0  10.0  10.0  10.0  10.0  10.0
12   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN

In [516]:
x[x.values == 3]

    q  w  e  r  t  y  u  i  o   p
0   1  2  3  3  3  4  4  4  4   4
0   1  2  3  3  3  4  4  4  4   4
0   1  2  3  3  3  4  4  4  4   4
5   1  2  3  4  5  6  7  8  9  10
8   1  2  3  4  5  6  7  8  9  10
12  1  2  3  4  5  6  7  8  9  10

**27.** A DataFrame has a column of groups 'grps' and and column of numbers 'vals'. For example: 

```python
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
```
For each *group*, find the sum of the three greatest values.

In [180]:
df_27 = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})

In [188]:
df_27

   grps  vals
0     a    12
1     a   345
2     a     3
3     b     1
4     b    45
5     c    14
6     a     4
7     a    52
8     b    54
9     c    23
10    c   235
11    c    21
12    b    57
13    b     3
14    c    87

In [189]:
df_27.groupby('grps')['vals'].nlargest()

grps
a     1     345
      7      52
      0      12
      6       4
      2       3
b     12     57
      8      54
      4      45
      13      3
      3       1
c     10    235
      14     87
      9      23
      11     21
      5      14
Name: vals, dtype: int64

In [192]:
df_27.groupby('grps')['vals'].nlargest(3).sum(level=1)

1     345
7      52
0      12
12     57
8      54
4      45
10    235
14     87
9      23
Name: vals, dtype: int64

In [184]:
df_27.groupby('grps')['vals'].nlargest(3).sum(level=0)

grps
a    409
b    156
c    345
Name: vals, dtype: int64

**28.** A DataFrame has two integer columns 'A' and 'B'. The values in 'A' are between 1 and 100 (inclusive). For each group of 10 consecutive integers in 'A' (i.e. `(0, 10]`, `(10, 20]`, ...), calculate the sum of the corresponding values in column 'B'.

In [65]:
df_28 = pd.DataFrame({'A': list(range(0,101)), 
                   'B': np.random.randint(20, size=101)})

In [216]:
df_28[(df_28['A'] > 0) & (df_28['A'] < 10)]['B'].sum()

94

In [66]:
bins = list(range(0,101,10))
labels = [f'{bint} - {bint+10}' for bint in bins][:-1]

In [67]:
df_28['A_grouped'] = pd.cut(df_28['A'], bins=bins, labels=labels)

In [68]:
df_28.groupby('A_grouped').get_group('0 - 10').sum()['B']

100

In [72]:
#sum of the corresponding values in column 'B'
df_28.groupby('A_grouped').sum()['B']

A_grouped
0 - 10      100
10 - 20     145
20 - 30      75
30 - 40      92
40 - 50     113
50 - 60      85
60 - 70      80
70 - 80     100
80 - 90     120
90 - 100     89
Name: B, dtype: int32

## DataFrames: harder problems 

### These might require a bit of thinking outside the box...

...but all are solvable using just the usual pandas/NumPy methods (and so avoid using explicit `for` loops).

Difficulty: *hard*

**29.** Consider a DataFrame `df` where there is an integer column 'X':
```python
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})
```
For each value, count the difference back to the previous zero (or the start of the Series, whichever is closer). These values should therefore be `[1, 2, 0, 1, 2, 3, 4, 0, 1, 2]`. Make this a new column 'Y'.

In [73]:
df_29 = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4],
            })
#[1, 2, 0, 1, 2, 3, 4, 0, 1, 2]

In [95]:
df_29['Y'] = df_29.eq(0).cumsum().mask(df_29.eq(0))

In [102]:
df_29['Y'] = (df_29.groupby('Y').cumcount() +1)

In [103]:
df_29['Y']

0    1
1    2
2    1
3    1
4    2
5    3
6    4
7    2
8    1
9    2
Name: Y, dtype: int64

In [105]:
df_29['Y'].mask(df_29['X'].eq(0), 0).tolist()

[1, 2, 0, 1, 2, 3, 4, 0, 1, 2]

Here's an alternative approach based on a [cookbook recipe](http://pandas.pydata.org/pandas-docs/stable/cookbook.html#grouping):

**30.** Consider a DataFrame containing rows and columns of purely numerical data. Create a list of the row-column index locations of the 3 largest values.

In [122]:
df_30 = pd.DataFrame(np.random.randint(20, size=(5,5)))

df_30

    0   1   2   3   4
0  13   0   2  15  19
1  19   6  13   7   2
2   9  16   4   4   8
3   7  13   6  17   2
4  16  10   9   6  19

In [123]:
df_30.unstack()#.sort_values()

0  0    13
   1    19
   2     9
   3     7
   4    16
1  0     0
   1     6
   2    16
   3    13
   4    10
2  0     2
   1    13
   2     4
   3     6
   4     9
3  0    15
   1     7
   2     4
   3    17
   4     6
4  0    19
   1     2
   2     8
   3     2
   4    19
dtype: int32

In [124]:
df_30.unstack().sort_values()[-3:].index.tolist()

[(4, 0), (0, 1), (4, 4)]

**31.** Given a DataFrame with a column of group IDs, 'grps', and a column of corresponding integer values, 'vals', replace any negative values in 'vals' with the group mean.

In [132]:
df_31 = pd.DataFrame({
    'grps': list('abcdefg'),
    'vals' : [1,-2,4,5,4,-5,-3]})
df_31.mean()

vals    0.571429
dtype: float64

In [134]:
df_31['vals'].mask(df_31['vals'].lt(0), df_31['vals'].mean())

0    1.000000
1    0.571429
2    4.000000
3    5.000000
4    4.000000
5    0.571429
6    0.571429
Name: vals, dtype: float64

**32.** Implement a rolling mean over groups with window size 3, which ignores NaN value. For example consider the following DataFrame:

```python
>>> df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
>>> df
   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0
```
The goal is to compute the Series:

```
0     1.000000
1     1.500000
2     3.000000
3     3.000000
4     1.666667
5     3.000000
6     3.000000
7     2.000000
8     3.666667
9     2.000000
10    4.500000
11    4.000000
```
E.g. the first window of size three for group 'b' has values 3.0, NaN and 3.0 and occurs at row index 5. Instead of being NaN the value in the new column at this row index should be 3.0 (just the two non-NaN values are used to compute the mean (3+3)/2)

In [193]:
df_32 = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})

In [194]:
g1 = df_32.groupby(['group'])['value']                
g2 = df_32.fillna(0).groupby(['group'])['value']    

s = g2.rolling(3, min_periods=1).sum() / g1.rolling(3, min_periods=1).count() # compute means

s.reset_index(level=0, drop=True).sort_index()

0     1.000000
1     1.500000
2     3.000000
3     3.000000
4     1.666667
5     3.000000
6     3.000000
7     2.000000
8     3.666667
9     2.000000
10    4.500000
11    4.000000
Name: value, dtype: float64

## Series and DatetimeIndex

### Exercises for creating and manipulating Series with datetime data

Difficulty: *easy/medium*

pandas is fantastic for working with dates and times. These puzzles explore some of this functionality.

**33.** Create a DatetimeIndex that contains each business day of 2015 and use it to index a Series of random numbers. Let's call this Series `s`.

In [201]:
pd.options.display.max_rows = 300
index = pd.date_range(start='2015-01-01', end='2015-12-31', freq='B') 
s = pd.Series(np.random.rand(len(index)), index=index)
s

2015-01-01    0.430670
2015-01-02    0.445357
2015-01-05    0.898391
2015-01-06    0.422352
2015-01-07    0.553736
2015-01-08    0.130172
2015-01-09    0.011230
2015-01-12    0.665802
2015-01-13    0.049747
2015-01-14    0.867663
2015-01-15    0.167364
2015-01-16    0.836813
2015-01-19    0.598976
2015-01-20    0.759004
2015-01-21    0.708124
2015-01-22    0.998054
2015-01-23    0.283990
2015-01-26    0.370874
2015-01-27    0.676500
2015-01-28    0.883589
2015-01-29    0.457639
2015-01-30    0.825472
2015-02-02    0.589083
2015-02-03    0.051544
2015-02-04    0.978291
2015-02-05    0.517622
2015-02-06    0.690718
2015-02-09    0.017199
2015-02-10    0.575451
2015-02-11    0.742218
2015-02-12    0.338556
2015-02-13    0.654494
2015-02-16    0.673903
2015-02-17    0.294803
2015-02-18    0.558768
2015-02-19    0.880341
2015-02-20    0.534482
2015-02-23    0.129322
2015-02-24    0.048882
2015-02-25    0.018893
2015-02-26    0.555335
2015-02-27    0.797186
2015-03-02    0.365984
2015-03-03    0.121710
2015-03-04    0.677143
2015-03-05    0.034737
2015-03-06    0.214075
2015-03-09    0.475224
2015-03-10    0.418628
2015-03-11    0.029746
2015-03-12    0.002778
2015-03-13    0.643052
2015-03-16    0.346397
2015-03-17    0.222425
2015-03-18    0.166470
2015-03-19    0.488964
2015-03-20    0.764607
2015-03-23    0.411670
2015-03-24    0.837984
2015-03-25    0.555365
2015-03-26    0.751214
2015-03-27    0.306804
2015-03-30    0.126825
2015-03-31    0.967882
2015-04-01    0.280381
2015-04-02    0.408940
2015-04-03    0.561335
2015-04-06    0.960588
2015-04-07    0.841683
2015-04-08    0.798762
2015-04-09    0.338252
2015-04-10    0.542058
2015-04-13    0.741566
2015-04-14    0.578542
2015-04-15    0.659248
2015-04-16    0.325974
2015-04-17    0.983291
2015-04-20    0.518621
2015-04-21    0.488096
2015-04-22    0.691279
2015-04-23    0.287874
2015-04-24    0.980501
2015-04-27    0.058907
2015-04-28    0.219941
2015-04-29    0.305918
2015-04-30    0.004579
2015-05-01    0.202546
2015-05-04    0.185618
2015-05-05    0.930019
2015-05-06    0.988532
2015-05-07    0.071935
2015-05-08    0.625533
2015-05-11    0.822090
2015-05-12    0.376962
2015-05-13    0.413518
2015-05-14    0.341001
2015-05-15    0.627036
2015-05-18    0.612575
2015-05-19    0.867553
2015-05-20    0.309382
2015-05-21    0.258193
2015-05-22    0.514695
2015-05-25    0.517424
2015-05-26    0.945281
2015-05-27    0.287406
2015-05-28    0.923006
2015-05-29    0.357020
2015-06-01    0.097212
2015-06-02    0.202290
2015-06-03    0.428502
2015-06-04    0.738011
2015-06-05    0.269454
2015-06-08    0.034952
2015-06-09    0.201318
2015-06-10    0.516062
2015-06-11    0.564546
2015-06-12    0.624850
2015-06-15    0.841463
2015-06-16    0.260731
2015-06-17    0.187441
2015-06-18    0.292170
2015-06-19    0.167244
2015-06-22    0.822415
2015-06-23    0.608096
2015-06-24    0.049964
2015-06-25    0.979624
2015-06-26    0.015005
2015-06-29    0.020699
2015-06-30    0.340191
2015-07-01    0.761537
2015-07-02    0.457542
2015-07-03    0.534585
2015-07-06    0.566178
2015-07-07    0.837023
2015-07-08    0.319254
2015-07-09    0.144670
2015-07-10    0.252234
2015-07-13    0.918252
2015-07-14    0.474599
2015-07-15    0.748812
2015-07-16    0.810845
2015-07-17    0.003856
2015-07-20    0.178560
2015-07-21    0.732501
2015-07-22    0.499558
2015-07-23    0.284526
2015-07-24    0.189680
2015-07-27    0.679410
2015-07-28    0.749985
2015-07-29    0.024703
2015-07-30    0.017696
2015-07-31    0.169901
2015-08-03    0.236843
2015-08-04    0.709055
2015-08-05    0.964713
2015-08-06    0.932881
2015-08-07    0.899041
2015-08-10    0.397721
2015-08-11    0.316748
2015-08-12    0.333302
2015-08-13    0.173191
2015-08-14    0.713536
2015-08-17    0.927169
2015-08-18    0.702115
2015-08-19    0.078673
2015-08-20    0.910912
2015-08-21    0.170829
2015-08-24    0.369936
2015-08-25    0.338689
2015-08-26    0.187765
2015-08-27    0.106055
2015-08-28    0.801069
2015-08-31    0.410128
2015-09-01    0.023514
2015-09-02    0.435264
2015-09-03    0.998219
2015-09-04    0.222380
2015-09-07    0.076093
2015-09-08    0.601116
2015-09-09    0.263809
2015-09-10    0.370431
2015-09-11    0.919867
2015-09-14    0.791983
2015-09-15    0.321358
2015-09-16    0.916125
2015-09-17    0.225007
2015-09-18    0.444448
2015-09-21    0.834157
2015-09-22    0.532856
2015-09-23    0.197186
2015-09-24    0.343455
2015-09-25    0.501944
2015-09-28    0.736167
2015-09-29    0.206976
2015-09-30    0.706889
2015-10-01    0.650768
2015-10-02    0.408539
2015-10-05    0.387917
2015-10-06    0.239708
2015-10-07    0.398624
2015-10-08    0.291532
2015-10-09    0.379431
2015-10-12    0.021674
2015-10-13    0.710476
2015-10-14    0.504360
2015-10-15    0.550734
2015-10-16    0.557965
2015-10-19    0.866808
2015-10-20    0.452545
2015-10-21    0.173689
2015-10-22    0.712478
2015-10-23    0.967382
2015-10-26    0.043618
2015-10-27    0.968511
2015-10-28    0.813858
2015-10-29    0.837400
2015-10-30    0.907582
2015-11-02    0.259563
2015-11-03    0.899130
2015-11-04    0.688553
2015-11-05    0.956069
2015-11-06    0.522571
2015-11-09    0.154428
2015-11-10    0.898417
2015-11-11    0.180394
2015-11-12    0.800644
2015-11-13    0.955537
2015-11-16    0.865737
2015-11-17    0.145547
2015-11-18    0.514787
2015-11-19    0.067847
2015-11-20    0.006872
2015-11-23    0.173580
2015-11-24    0.402087
2015-11-25    0.961175
2015-11-26    0.905874
2015-11-27    0.278471
2015-11-30    0.081720
2015-12-01    0.418247
2015-12-02    0.293933
2015-12-03    0.233732
2015-12-04    0.259312
2015-12-07    0.551066
2015-12-08    0.037541
2015-12-09    0.428328
2015-12-10    0.606219
2015-12-11    0.421485
2015-12-14    0.758363
2015-12-15    0.566023
2015-12-16    0.091033
2015-12-17    0.033217
2015-12-18    0.292152
2015-12-21    0.705456
2015-12-22    0.914542
2015-12-23    0.138471
2015-12-24    0.852289
2015-12-25    0.096320
2015-12-28    0.466103
2015-12-29    0.622061
2015-12-30    0.664758
2015-12-31    0.565188
Freq: B, dtype: float64

**34.** Find the sum of the values in `s` for every Wednesday.

In [205]:
s[s.index.weekday == 2].sum()

24.945957083318326

**35.** For each calendar month in `s`, find the mean of values.

In [208]:
s.resample('M').mean()

2015-01-31    0.547342
2015-02-28    0.482355
2015-03-31    0.405895
2015-04-30    0.526197
2015-05-31    0.532254
2015-06-30    0.375556
2015-07-31    0.450257
2015-08-31    0.508589
2015-09-30    0.484966
2015-10-31    0.538436
2015-11-30    0.510429
2015-12-31    0.435471
Freq: M, dtype: float64

**36.** For each group of four consecutive calendar months in `s`, find the date on which the highest value occurred.

In [214]:
s.groupby(pd.Grouper(freq='4M')).idxmax()

2015-01-31   2015-01-22
2015-05-31   2015-05-06
2015-09-30   2015-09-03
2016-01-31   2015-10-27
Freq: 4M, dtype: datetime64[ns]

**37.** Create a DateTimeIndex consisting of the third Thursday in each month for the years 2015 and 2016.

In [221]:
pd.date_range('2015-01-01', '2016-12-31', freq='WOM-3THU')

DatetimeIndex(['2015-01-15', '2015-02-19', '2015-03-19', '2015-04-16',
               '2015-05-21', '2015-06-18', '2015-07-16', '2015-08-20',
               '2015-09-17', '2015-10-15', '2015-11-19', '2015-12-17',
               '2016-01-21', '2016-02-18', '2016-03-17', '2016-04-21',
               '2016-05-19', '2016-06-16', '2016-07-21', '2016-08-18',
               '2016-09-15', '2016-10-20', '2016-11-17', '2016-12-15'],
              dtype='datetime64[ns]', freq='WOM-3THU')

## Cleaning Data

### Making a DataFrame easier to work with

Difficulty: *easy/medium*

It happens all the time: someone gives you data containing malformed strings, Python, lists and missing data. How do you tidy it up so you can get on with the analysis?

Take this monstrosity as the DataFrame to use in the following puzzles:

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```
(It's some flight data I made up; it's not meant to be accurate in any way.)

In [222]:
flight_data = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})

In [223]:
flight_data

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

**38.** Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [224]:
flight_data['FlightNumber'] = flight_data['FlightNumber'].interpolate().astype(int)

In [225]:
flight_data

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

**39.** The From\_To column would be better as two separate columns! Split each string on the underscore delimiter `_` to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [236]:
travel_city = flight_data['From_To'].str.split('_', expand=True)
travel_city.columns = ['From', 'To']

In [238]:
travel_city

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

**40.** Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [239]:
travel_city['From'] = travel_city['From'].str.capitalize()

In [241]:
travel_city['To'] = travel_city['To'].str.capitalize()

In [242]:
travel_city

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

**41.** Delete the From_To column from `df` and attach the temporary DataFrame from the previous questions.

In [249]:
flight_data.drop('From_To', axis=1, inplace=True)

In [253]:
flight_data = flight_data.join(travel_city)

In [254]:
flight_data

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

**42**. In the Airline column, you can see some extra puctuation and symbols have appeared around the airline names. Pull out just the airline name. E.g. `'(British Airways. )'` should become `'British Airways'`.

In [258]:
flight_data['Airline'] = flight_data['Airline'].str.extract('([a-zA-Z\s]+)', expand=False).str.strip()

In [256]:
flight_data

   FlightNumber  RecentDelays          Airline      From         To
0         10045      [23, 47]              KLM    London      Paris
1         10055            []       Air France    Madrid      Milan
2         10065  [24, 43, 87]  British Airways    London  Stockholm
3         10075          [13]       Air France  Budapest      Paris
4         10085      [67, 32]        Swiss Air  Brussels     London

**43**. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

Expand the Series of lists into a DataFrame named `delays`, rename the columns `delay_1`, `delay_2`, etc. and replace the unwanted RecentDelays column in `df` with `delays`.

In [295]:
delays1 = pd.DataFrame(flight_data['RecentDelays'].tolist(),index=flight_data.index, columns=range(1,4)).add_prefix('delay_')

In [304]:
flight_data = flight_data.join(delays1)

In [284]:
delays = flight_data['RecentDelays'].apply(pd.Series)

      0     1     2
0  23.0  47.0   NaN
1   NaN   NaN   NaN
2  24.0  43.0  87.0
3  13.0   NaN   NaN
4  67.0  32.0   NaN

In [301]:
flight_data.drop('RecentDelays', axis='columns', inplace=True)

The DataFrame should look much better now.

In [305]:
flight_data

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045,KLM,London,Paris,23.0,47.0,NaN
1,10055,Air France,Madrid,Milan,NaN,NaN,NaN
2,10065,British Airways,London,Stockholm,24.0,43.0,87.0
3,10075,Air France,Budapest,Paris,13.0,NaN,NaN
4,10085,Swiss Air,Brussels,London,67.0,32.0,NaN

## Using MultiIndexes

### Go beyond flat DataFrames with additional index levels

Difficulty: *medium*

Previous exercises have seen us analysing data from DataFrames equipped with a single index level. However, pandas also gives you the possibilty of indexing your data using *multiple* levels. This is very much like adding new dimensions to a Series or a DataFrame. For example, a Series is 1D, but by using a MultiIndex with 2 levels we gain of much the same functionality as a 2D DataFrame.

The set of puzzles below explores how you might use multiple index levels to enhance data analysis.

To warm up, we'll look make a Series with two index levels.

**44**. Given the lists `letters = ['A', 'B', 'C']` and `numbers = list(range(10))`, construct a MultiIndex object from the product of the two lists. Use it to index a Series of random numbers. Call this Series `s`.

In [318]:
letters = ['A', 'B', 'C']
numbers = list(range(10))
index = pd.MultiIndex.from_product([letters, numbers])
s = pd.Series(np.random.rand(30), index=index)

In [319]:
s

A  0    0.553820
   1    0.912931
   2    0.063110
   3    0.004364
   4    0.298985
   5    0.807361
   6    0.582130
   7    0.687235
   8    0.417028
   9    0.250781
B  0    0.085555
   1    0.348233
   2    0.600324
   3    0.576244
   4    0.112407
   5    0.371440
   6    0.692122
   7    0.237000
   8    0.029018
   9    0.427476
C  0    0.581594
   1    0.109261
   2    0.920227
   3    0.564173
   4    0.168226
   5    0.195288
   6    0.433473
   7    0.764864
   8    0.120854
   9    0.692515
dtype: float64

**45.** Check the index of `s` is lexicographically sorted (this is a necessary proprty for indexing to work correctly with a MultiIndex).

In [320]:
s.index.is_lexsorted()

True

**46**. Select the labels `1`, `3` and `6` from the second level of the MultiIndexed Series.

In [324]:
s.loc[:, [1,3,6]]

A  1    0.912931
   3    0.004364
   6    0.582130
B  1    0.348233
   3    0.576244
   6    0.692122
C  1    0.109261
   3    0.564173
   6    0.433473
dtype: float64

**47**. Slice the Series `s`; slice up to label 'B' for the first level and from label 5 onwards for the second level.

In [327]:
s.loc[:'B', 5:]

A  5    0.807361
   6    0.582130
   7    0.687235
   8    0.417028
   9    0.250781
B  5    0.371440
   6    0.692122
   7    0.237000
   8    0.029018
   9    0.427476
dtype: float64

**48**. Sum the values in `s` for each label in the first level (you should have Series giving you a total for labels A, B and C).

In [333]:
s.sum(level=0)

A    4.577746
B    3.479819
C    4.550476
dtype: float64

**49**. Suppose that `sum()` (and other methods) did not accept a `level` keyword argument. How else could you perform the equivalent of `s.sum(level=1)`?

In [336]:
s

A  0    0.553820
   1    0.912931
   2    0.063110
   3    0.004364
   4    0.298985
   5    0.807361
   6    0.582130
   7    0.687235
   8    0.417028
   9    0.250781
B  0    0.085555
   1    0.348233
   2    0.600324
   3    0.576244
   4    0.112407
   5    0.371440
   6    0.692122
   7    0.237000
   8    0.029018
   9    0.427476
C  0    0.581594
   1    0.109261
   2    0.920227
   3    0.564173
   4    0.168226
   5    0.195288
   6    0.433473
   7    0.764864
   8    0.120854
   9    0.692515
dtype: float64

In [340]:
s.unstack()

,0,1,2,3,4,5,6,7,8,9
A,0.553820,0.912931,0.063110,0.004364,0.298985,0.807361,0.582130,0.687235,0.417028,0.250781
B,0.085555,0.348233,0.600324,0.576244,0.112407,0.371440,0.692122,0.237000,0.029018,0.427476
C,0.581594,0.109261,0.920227,0.564173,0.168226,0.195288,0.433473,0.764864,0.120854,0.692515

In [338]:
s.unstack().sum(axis=0)

0    1.220969
1    1.370426
2    1.583661
3    1.144782
4    0.579618
5    1.374090
6    1.707725
7    1.689099
8    0.566901
9    1.370772
dtype: float64

**50**. Exchange the levels of the MultiIndex so we have an index of the form (letters, numbers). Is this new Series properly lexsorted? If not, sort it.

In [341]:
new_s = s.swaplevel(0, 1)

In [343]:
new_s

0  A    0.553820
1  A    0.912931
2  A    0.063110
3  A    0.004364
4  A    0.298985
5  A    0.807361
6  A    0.582130
7  A    0.687235
8  A    0.417028
9  A    0.250781
0  B    0.085555
1  B    0.348233
2  B    0.600324
3  B    0.576244
4  B    0.112407
5  B    0.371440
6  B    0.692122
7  B    0.237000
8  B    0.029018
9  B    0.427476
0  C    0.581594
1  C    0.109261
2  C    0.920227
3  C    0.564173
4  C    0.168226
5  C    0.195288
6  C    0.433473
7  C    0.764864
8  C    0.120854
9  C    0.692515
dtype: float64

In [350]:
new_s_sorted = new_s.sort_index()
new_s_sorted

0  A    0.553820
   B    0.085555
   C    0.581594
1  A    0.912931
   B    0.348233
   C    0.109261
2  A    0.063110
   B    0.600324
   C    0.920227
3  A    0.004364
   B    0.576244
   C    0.564173
4  A    0.298985
   B    0.112407
   C    0.168226
5  A    0.807361
   B    0.371440
   C    0.195288
6  A    0.582130
   B    0.692122
   C    0.433473
7  A    0.687235
   B    0.237000
   C    0.764864
8  A    0.417028
   B    0.029018
   C    0.120854
9  A    0.250781
   B    0.427476
   C    0.692515
dtype: float64

In [349]:
new_s_sorted.index.is_lexsorted()

True